Revit 2027 API
RebarShapeDefinitionByArc.SetArcTypeSpiral Method
 Set the RebarShapeDefinitionByArc.Type property to Spiral.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetArcTypeSpiral(
	double height,
	double pitch,
	int baseFinishingTurns,
	int topFinishingTurns
)
Public Sub SetArcTypeSpiral (
	height As Double,
	pitch As Double,
	baseFinishingTurns As Integer,
	topFinishingTurns As Integer
)
public:
void SetArcTypeSpiral(
	double height,
	double pitch,
	int baseFinishingTurns,
	int topFinishingTurns
)
member SetArcTypeSpiral :
        height : float *
        pitch : float *
        baseFinishingTurns : int *
        topFinishingTurns : int -> unit
Parameters
height Double
 The height of the spiral (assuming the spiral is vertical).
pitch Double
 The pitch, or vertical distance traveled in one rotation.
baseFinishingTurns Int32
 The number of finishing turns at the lower end of the spiral.
topFinishingTurns Int32
 The number of finishing turns at the upper end of the spiral.
Exceptions
Exception | Condition
ArgumentException |  baseFinishingTurns is not between 0 and 100. -or- topFinishingTurns is not between 0 and 100.
ArgumentOutOfRangeException |  The given value for height must be greater than 0 and no more than 30000 feet. -or- The given value for pitch must be greater than 0 and no more than 30000 feet.
Remarks
 In order to create a spiral definition, you must provide default values for height, pitch, and finishing turns.
See Also
Reference
RebarShapeDefinitionByArc Class
Autodesk.Revit.DB.Structure Namespace